[
    {
        "id_realisation": 13,
        "titre": "LowCase",
        "id_categorie": 1,
        "url_cover": "realisations/13/screenshot_4.jpg",
        "url_images": [
            "realisations/13/screenshot_1.jpg",
            "realisations/13/screenshot_2.jpg",
            "realisations/13/screenshot_3.jpg",
            "realisations/13/screenshot_5.jpg"
        ],
        "description": "Back Office pour la vente de matériel d'occasion",
        "infos": "Création d'annonces de vente de matériel, incluant toutes les infos nécessaires.",
        "infos2": "Choix d'une catégorie, ajout/suppression de photos, ajout de rubriques propres à chaque type d'articles.",
        "defi": "Uniformiser le format des annonces malgré des articles très hétérogènes.",
        "solution": "Création d'une base de données des caractéristiques partagées par tous les articles (taille, état...).",
        "lien_github": "",
        "lien": "",
        "tags_id": [
            16,
            17,
            19,
            2
        ]
    },
    {
        "id_realisation": 1,
        "titre": "Nestor Bikes",
        "id_categorie": 1,
        "url_cover": "realisations/1/cover.jpg",
        "url_images": [
            "realisations/1/screenshot_1.jpg",
            "realisations/1/screenshot_2.jpg",
            "realisations/1/screenshot_3.jpg",
            "realisations/1/screenshot_4.jpg"
        ],
        "description": "Application de réservations de vélos en ligne",
        "infos": "Réservations de vélos avec paiement en ligne pour les clients.",
        "infos2": "Outil back office pour le personnel : création de contrats de location, gestion des stocks, contrôle des fluxs de vélos journaliers.",
        "defi": "Mise en place du paiement en ligne pour valider les réservations.",
        "solution": "Intégration de hashage sha256 et cryptage Blowfish. Configuration du serveur Node.js/Express pour intercepter les retours x-www-url-encoded en provenance de la Banque.",
        "lien_github": "",
        "lien": "https://nestor-bikes-moutchic-loisirs.web.app/",
        "tags_id": [
            1,
            2,
            3,
            4
        ]
    },
    {
        "id_realisation": 2,
        "titre": "Nestor Surf",
        "id_categorie": 1,
        "url_cover": "realisations/2/cover.jpg",
        "url_images": [
            "realisations/2/screenshot_1.jpg",
            "realisations/2/screenshot_2.jpg",
            "realisations/2/screenshot_3.jpg",
            "realisations/2/screenshot_4.jpg"
        ],
        "description": "Application de réservations de cours de surf en ligne",
        "infos": "Demande de réservations de sessions de surf, grâce à un planning interactif.",
        "infos2": "Le client peut choisir ses sessions, pour chaque élève concerné, et les formules tarifaires sont automatiquement calculées. L'école reçoit la demande du client et peut ensuite renvoyer, soit une confirmation directe pour la demande, soit renvoyer une autre proposition avec des horaires différents (en fonction de la météo, des marées, du niveau de surf des élèves).",
        "defi": "Gérer les échanges client/école jusqu'à confirmation de la réservation",
        "solution": "Envoie de mails gérés avec Nodemailer sur serveur Node.js. Mise en place d'un système de message/chat pour compléter les échanges. ",
        "lien_github": "",
        "lien": "https://www.wallyglisse.com/reservations.html",
        "tags_id": [
            1,
            2,
            3,
            4
        ]
    },
    {
        "id_realisation": 3,
        "titre": "Booki",
        "id_categorie": 2,
        "url_cover": "realisations/3/cover.jpg",
        "url_images": [
            "realisations/3/screenshot_1.jpg",
            "realisations/3/screenshot_2.jpg",
            "realisations/3/screenshot_3.jpg",
            "realisations/3/screenshot_4.jpg"
        ],
        "description": "Page d'accueil d'un site de voyage",
        "infos": "Premier projet de la formation 'Développeur web' : intégration html/css",
        "infos2": "En se basant sur les maquettes Desktop/tablette/mobile fournies, l'objectif était de récréer à l'identique les mises en page demandées pour la homepage de cette agence de voyage. Codage html et css pur, sans framework ni bibliothèque tierce.",
        "defi": "Produire une structure html cohérente pour l'adapter à tous les formats d'écrans. Respect des normes de sémantique",
        "solution": "Le découpage de la maquette fournie, en toute première étape de la réalisation du projet, a permis d'anticiper en amont tous ces futurs challenge et de répondre à la fois aux enjeux de mise en page responsive et de sémantique pour faciliter le travail des robots pour le référencement.",
        "lien_github": "https://github.com/manuelvivion/P2_booki_homepage.git",
        "lien": "https://manuelvivion.github.io/P2_booki_homepage/",
        "tags_id": [
            5,
            6,
            7
        ]
    },
    {
        "id_realisation": 4,
        "titre": "Portfolio Sophie Buel",
        "id_categorie": 2,
        "url_cover": "realisations/4/cover.jpg",
        "url_images": [
            "realisations/4/screenshot_1.jpg",
            "realisations/4/screenshot_2.jpg",
            "realisations/4/screenshot_3.jpg",
            "realisations/4/screenshot_4.jpg"
        ],
        "description": "Développement d'un site dynamique avec Javascript",
        "infos": "Manipulation du DOM et communications avec un backend.",
        "infos2": "L'objectif du projet était de créer un outil de mise à jour du site internet. L'affichage du contenu du site se fait dynamiquement en communiquant avec un backend, via des requêtes fetch. J'ai implémenté une interface d'identification pour pouvoir communiquer avec ce backend sur les opérations sensibles. Grâce à la manipulation du DOM avec Javascript, Les fonctions d'administration ne sont affichées à l'écran uniquement si la procédure d'identification est validée (grâce à un système de token crypté).",
        "defi": "Créer un site intéractif et dynamique sans framework ni bibliothèque.",
        "solution": "L'utilisation de Javascript m'a permis de manipuler tous les éléments du DOM et de pouvoir conditionner la création et l'affichage de certains éléments. C'est également Javascript, en tant que langage commun, qui m'a permis d'envoyer des requêtes au backend et d'en interpréter les réponses, pour les traiter. Enfin, grâce à un système de 'modules', j'ai pu organiser, découper tout mon code Javascript en fonctions / fichiers / dossiers.",
        "lien_github": "https://github.com/manuelvivion/P3_portfolio_dynamique.git",
        "lien": "",
        "tags_id": [
            5,
            6,
            8,
            9
        ]
    },
    {
        "id_realisation": 5,
        "titre": "Kasa",
        "id_categorie": 2,
        "url_cover": "realisations/5/cover.jpg",
        "url_images": [
            "realisations/5/screenshot_1.jpg",
            "realisations/5/screenshot_2.jpg",
            "realisations/5/screenshot_3.jpg",
            "realisations/5/screenshot_4.jpg"
        ],
        "description": "Application front-end React",
        "infos": "Prise en main de React. Utilisation des composants, manipulation des states et mise en place d'un router pour gérer la navigation.",
        "infos2": "Des maquettes desktop et mobile étaient fournies pour créer une application de présentation de logements à la location entre particuliers. En bonus, j'ai ajouté un système de favoris. Pour cela, j'ai dû implémenter le système Redux qui m'a permis de stocker des states au niveau 'global' que j'ai pu dispatcher entre toutes les pages et composants de l'application.",
        "defi": "optimiser le temps et la quantité de code en réutilisant des composants communs.",
        "solution": "La création de composants et leurs personnalisations grâce aux 'props' m'a permis de ne coder qu'une seule fois des éléments présents à de nombreux endroits (les headers et footers présents sur chaque pages, les 'collapses' présents sur plusieurs pages, la 'fiche' logement).",
        "lien_github": "https://github.com/manuelvivion/P6_React_Kasa.git",
        "lien": "https://kasa-react-oc.web.app/",
        "tags_id": [
            1,
            8,
            3
        ]
    },
    {
        "id_realisation": 6,
        "titre": "Mon vieux Grimoire",
        "id_categorie": 2,
        "url_cover": "realisations/6/cover.jpg",
        "url_images": [
            "realisations/6/screenshot_1.jpg",
            "realisations/6/screenshot_2.jpg",
            "realisations/6/screenshot_3.jpg",
            "realisations/6/screenshot_4.jpg"
        ],
        "description": "Backend Node.Js / Express / MongoDB",
        "infos": "Création d'un serveur en Javascript capable de recevoir et de traiter les requêtes envoyées par le front-end d'un site web de présentation de livres.",
        "infos2": "L'association du framework Express, d'une base de données NoSql MongoDB et de l'eco-système Node.js m'a permis de toutes les requêtes de type C.R.U.D. La communication entre le serveur et la base de données est facilité par l'ORM Mongoose.",
        "defi": "Mettre en place ce backend en respectant les normes de sécurité.",
        "solution": "Les recommandations fournies par l'OWASP m'ont donné un cadre et des consignes à respecter. J'ai ajouté un cryptage Bcrypt sur les informations des utilisateurs stockées dans la base de données. Pour les requêtes critiques envoyées au serveur, un middleware d'authentification a été ajouté aux routes pour confirmer l'identification du demandeur. Cette confirmation se fait par le contôle d'un token qui est envoyé à l'utilisateur, puis demandé à nouveau lors des requêtes sensibles.",
        "lien_github": "https://github.com/manuelvivion/P7_MonVieuxGrimoire",
        "lien": "",
        "tags_id": [
            2,
            4,
            8,
            10
        ]
    },
    {
        "id_realisation": 7,
        "titre": "Menu maker",
        "id_categorie": 2,
        "url_cover": "realisations/7/cover.jpg",
        "url_images": [
            "realisations/7/screenshot_1.jpg",
            "realisations/7/screenshot_2.jpg",
            "realisations/7/screenshot_3.jpg",
            "realisations/7/screenshot_4.jpg"
        ],
        "description": "Analyser, spécifier, planifier un projet",
        "infos": "",
        "infos2": "En se basant sur des spécifications fonctionnelles fournies par les client et des user stories, je devais proposer une solution technique répondant à chaque spécification. Ensuite, d'après ces choix, je devais organiser l'équipe pour mener à bien ce projet et plannifier l'avancée.",
        "defi": "Trouver une manière de s'organiser pour répondre aux besoins du client, l'impliquer dans la réalisation tout en optimisant le temps et les ressources disponibles.",
        "solution": "La méthode agile donne un cadre pour gérer ça. En avançant par itération et incrémentation, cela permet de valider au fur et à mesure l'avancée du projet. Cela permet aussi au client de tester au fur et à mesure les fonctions principales demandées pour éviter les incompréhension et les retours en arrière.",
        "lien_github": "",
        "lien": "https://oc-visio-archive.s3.eu-west-1.amazonaws.com/46969134/28e1b3e1-464e-4f5b-8c13-798a54db1a15/archive.mp4?X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAT2XCRSRLEJNVDK5T%2F20240430%2Feu-west-1%2Fs3%2Faws4_request&X-Amz-Date=20240430T104922Z&X-Amz-SignedHeaders=host&X-Amz-Expires=3600&X-Amz-Signature=e6974827cdb491225c6d7aa45d38ccb456af909c78bf5990214187e51015efbe",
        "tags_id": [
            11,
            12
        ]
    },
    {
        "id_realisation": 8,
        "titre": "Nina Carducci",
        "id_categorie": 2,
        "url_cover": "realisations/8/cover.jpg",
        "url_images": [
            "realisations/8/screenshot_1.jpg",
            "realisations/8/screenshot_2.jpg",
            "realisations/8/screenshot_3.jpg",
            "realisations/8/screenshot_4.jpg"
        ],
        "description": "Optimisation et deboggage d'un site web",
        "infos": "La cliente m'a fourni le code de son site (html/css/JQuery) pour me demander de débogger certaines fonctionnalités, d'optimiser les performances d'affichage du site ainsi que le référencement naturel (SEO).",
        "infos2": "La première étape a été de m'imprégner du code JQuery pour comprendre sa logique et chercher les bugs affectant certaines fonctionnalités. Ensuite, en me basant sur les rapports d'audit Lighthouse et Wave, j'avais une liste d'éléments sur lesquels travailler pour augmenter les 'scores' de performances, de SEO et d'accessibilité.",
        "defi": "Modifier le code fourni, et ajouter certains éléments, pour augmenter les performances SEO du site et assurer à la cliente une meilleure visibilité, et accroître potentiellement sa clientèle.",
        "solution": "La première étape a été de modifier la structure du code html afin de respecter toutes les normes de sémantiques et faciliter le travail des robots. De plus, j'ai ajouté des balises 'rich snippet' schéma.org pour renforcer le référencement local en précisant des informations pratiques concrètes. Enfin, l'ajout de balises <meta> dans le header du code html permet de spécifier aux réseaux sociaux de quelle manière interpréter et afficher les infos présentes sur le site de Nina Carducci.",
        "lien_github": "https://github.com/manuelvivion/P5-NinaCarducci.git",
        "lien": "https://manuelvivion.github.io/P5-NinaCarducci/",
        "tags_id": [
            5,
            6,
            8,
            13,
            14,
            15
        ]
    },
    {
        "id_realisation": 9,
        "titre": "Moutchic Loisirs",
        "id_categorie": 3,
        "url_cover": "realisations/9/cover.jpg",
        "url_images": [
            "realisations/9/screenshot_1.jpg",
            "realisations/9/screenshot_2.jpg",
            "realisations/9/screenshot_3.jpg",
            "realisations/9/screenshot_4.jpg"
        ],
        "description": "Site de présentation de l'activité, en html/css",
        "infos": "Présentation de Moutchic Loisirs. Basé au lac du Moutchic à Lacanau : location de cycles, de pédalos et barques à moteur. Hébergements eco-responsables. ",
        "infos2": "Codage html/css. Gestion de la traduction en anglais avec des variables PHP. Création du contenu multi-média (photos et vidéos).",
        "defi": "string",
        "solution": "string",
        "lien_github": "",
        "lien": "https://www.moutchic-loisirs.com/",
        "tags_id": [
            5,
            6,
            9
        ]
    },
    {
        "id_realisation": 10,
        "titre": "Wally Glisse",
        "id_categorie": 3,
        "url_cover": "realisations/10/cover.jpg",
        "url_images": [
            "realisations/10/screenshot_1.jpg",
            "realisations/10/screenshot_2.jpg",
            "realisations/10/screenshot_3.jpg",
            "realisations/10/screenshot_4.jpg"
        ],
        "description": "Site vitrine html/css + Paiements en ligne",
        "infos": "Présentation de l'école de surf et de skateboard.",
        "infos2": "Codage html/css + Bootstrap (sans CMS). Gestion de la traduction. Intégration d'un page de commande et de paiement en ligne (tout en PHP).",
        "defi": "string",
        "solution": "string",
        "lien_github": "",
        "lien": "https://www.wallyglisse.com/",
        "tags_id": [
            5,
            6,
            9
        ]
    },
    {
        "id_realisation": 11,
        "titre": "Cours Snowboard Chamrousse",
        "id_categorie": 3,
        "url_cover": "realisations/11/cover.jpg",
        "url_images": [
            "realisations/11/screenshot_1.jpg",
            "realisations/11/screenshot_2.jpg",
            "realisations/11/screenshot_3.jpg",
            "realisations/11/screenshot_4.jpg"
        ],
        "description": "Site de présentation de l'école de snowboard.",
        "infos": "Codage html/css + Bootstrap (sans CMS). Présentation de l'activité et des tarifs de l'école de snowboard basée à chamrousse. Plan et infos pratiques.",
        "infos2": "",
        "defi": "string",
        "solution": "string",
        "lien_github": "",
        "lien": "https://cours-snowboard-chamrousse.fr/",
        "tags_id": [
            5,
            6,
            9
        ]
    },
    {
        "id_realisation": 12,
        "titre": "Mon Portfolio",
        "id_categorie": 2,
        "url_cover": "realisations/12/cover.jpg",
        "url_images": [
            "realisations/12/screenshot_1.jpg",
            "realisations/12/screenshot_2.jpg",
            "realisations/12/screenshot_3.jpg",
            "realisations/12/screenshot_4.jpg"
        ],
        "description": "Création d'un portfolio dynamique avec React.js et fichiers JSON",
        "infos": "Présentation de mes réalisations, mes compétences, mes expériences.",
        "infos2": "Choix techniques : Application React. Bibliothèque Material UI pour l'interface. Sass pour les feuilles de style. Fichiers JSON en data. Déploiement sur Firebase (google).",
        "defi": "Intégrer un système de mise à jour simple pour pouvoir facilement faire évoluer ce portfolio. ",
        "solution": "L'utilisation de fichiers structurés au format JSON, comme 'base de données', couplée à l'utilisation de composants React réplicables et personnalisables, me permet très rapidement de faire évoluer la présentation du site et réutilisant la trame de base et sans avoir à reprendre tout mon code. Je me sers également de ces fichiers JSON pour créer des relations entre les différents types de données et donner au site plus de dynamisme (ex : lier les compétences aux réalisations, les soft skills aux expériences...).",
        "lien_github": "https://github.com/manuelvivion/P8-portfolio.git",
        "lien": "https://manuel-vivion-portfolio.web.app/",
        "tags_id": [
            1,
            7,
            8,
            13,
            14
        ]
    }
]